================================================================================
strings
================================================================================

""       %% empty string
"hello, world!"
"hello ""world"
"hello, \"tree-sitter\"\n"

--------------------------------------------------------------------------------

(source
  (string)
  (comment)
  (string
    (quoted_content))
  (string
    (quoted_content))
  (string
    (quoted_content))
  (string
    (quoted_content)
    (escape_sequence)
    (quoted_content)
    (escape_sequence)
    (escape_sequence)))

================================================================================
atoms
================================================================================

ok
hello
'%'      %% escaping '%'
'123'

--------------------------------------------------------------------------------

(source
  (atom)
  (atom)
  (quoted_atom
    (quoted_content))
  (comment)
  (quoted_atom
    (quoted_content)))

================================================================================
numbers
================================================================================

$a        %% erlang docs consider characters to be numbers
$-
$\n
1
100
1_000_000
2#101101
16#deadbeef
1.01
2.3e3
2.3e-3
0.1
2_000.000_002

--------------------------------------------------------------------------------

(source
  (character)
  (comment)
  (character)
  (character
    (escape_sequence))
  (integer)
  (integer)
  (integer)
  (integer)
  (integer)
  (float)
  (float)
  (float)
  (float)
  (float))

================================================================================
variables
================================================================================

Variable
_
_Ignore
Var1
Var@1

--------------------------------------------------------------------------------

(source
  (variable)
  (variable)
  (variable)
  (variable)
  (variable))

================================================================================
bitstrings
================================================================================

<<>>
<<"hello, binaries!">>
<<MyBinary>>
<<$a, $b, $c>>
<<String0/bitstring,0:(8-Rem)>>
<<N:Bytes/unit:8>>
<<0.1:10/native-unsigned>>
<<"hello" ++ _>>

--------------------------------------------------------------------------------

(source
  (bitstring)
  (bitstring
    (string
      (quoted_content)))
  (bitstring
    (variable))
  (bitstring
    (character)
    (character)
    (character))
  (bitstring
    (binary_operator
      (variable)
      (atom))
    (binary_operator
      (integer)
      (binary_operator
        (integer)
        (variable))))
  (bitstring
    (binary_operator
      (binary_operator
        (binary_operator
          (variable)
          (variable))
        (atom))
      (integer)))
  (bitstring
    (binary_operator
      (binary_operator
        (binary_operator
          (float)
          (integer))
        (atom))
      (atom)))
  (bitstring
    (binary_operator
      (string
        (quoted_content))
      (variable))))

================================================================================
tuples
================================================================================

{}
{a, b, c}
{{{}}}

--------------------------------------------------------------------------------

(source
  (tuple)
  (tuple
    (atom)
    (atom)
    (atom))
  (tuple
    (tuple
      (tuple))))

================================================================================
lists
================================================================================

[]
[a, b, c]
[[[]]]
[a | [b | [c]]]
[from_asm, {validate, false}]

--------------------------------------------------------------------------------

(source
  (list)
  (list
    (atom)
    (atom)
    (atom))
  (list
    (list
      (list)))
  (list
    (binary_operator
      (atom)
      (list
        (binary_operator
          (atom)
          (list
            (atom))))))
  (list
    (atom)
    (tuple
      (atom)
      (atom))))

================================================================================
maps
================================================================================

#{}
#{a => b, c => d}
MyMap#{a => b}

--------------------------------------------------------------------------------

(source
  (map)
  (map
    (map_content
      (binary_operator
        (atom)
        (atom))
      (binary_operator
        (atom)
        (atom))))
  (map
    (variable)
    (map_content
      (binary_operator
        (atom)
        (atom)))))

================================================================================
records
================================================================================

#function{entry = 1}
#Var{}
#function
MyFunction#function{entry = 1}
#function.entry     %% syntax for the element's index in the tuple

--------------------------------------------------------------------------------

(source
  (record
    (atom)
    (record_content
      (binary_operator
        (atom)
        (integer))))
  (record
    (variable))
  (record
    (atom))
  (record
    (variable)
    (atom)
    (record_content
      (binary_operator
        (atom)
        (integer))))
  (binary_operator
    (record
      (atom))
    (atom))
  (comment))
