================================================================================
strings
================================================================================

""       %% empty string
"hello, world!"
"hello, \"tree-sitter\"\n"

--------------------------------------------------------------------------------

(source
  (string)
  (comment)
  (string
    (quoted_content))
  (string
    (quoted_content)
    (escape_sequence)
    (quoted_content)
    (escape_sequence)
    (escape_sequence)))

================================================================================
atoms
================================================================================

ok
hello
'%'      %% escaping '%'
'123'

--------------------------------------------------------------------------------

(source
  (atom)
  (atom)
  (quoted_atom
    (quoted_content))
  (comment)
  (quoted_atom
    (quoted_content)))

================================================================================
numbers
================================================================================

$a        %% erlang docs consider characters to be numbers
$-
$\n
1
100
1_000_000
2#101101
16#deadbeef
1.01
2.3e3
2.3e-3
0.1
2_000.000_002

--------------------------------------------------------------------------------

(source
  (character)
  (comment)
  (character)
  (character
    (escape_sequence))
  (integer)
  (integer)
  (integer)
  (integer)
  (integer)
  (float)
  (float)
  (float)
  (float)
  (float))

================================================================================
variables
================================================================================

Variable
_
_Ignore
Var1
Var@1

--------------------------------------------------------------------------------

(source
  (variable)
  (variable)
  (variable)
  (variable)
  (variable))

================================================================================
bitstrings
================================================================================

<<>>
<<"hello, binaries!">>
<<MyBinary>>
<<$a, $b, $c>>

--------------------------------------------------------------------------------

(source
  (bitstring)
  (bitstring
    (string
      (quoted_content)))
  (bitstring
    (variable))
  (bitstring
    (character)
    (character)
    (character)))

================================================================================
tuples
================================================================================

{}
{a, b, c}
{{{}}}

--------------------------------------------------------------------------------

(source
  (tuple)
  (tuple
    (atom)
    (atom)
    (atom))
  (tuple
    (tuple
      (tuple))))

================================================================================
lists
================================================================================

[]
[a, b, c]
[[[]]]

--------------------------------------------------------------------------------

(source
  (list)
  (list
    (atom)
    (atom)
    (atom))
  (list
    (list
      (list))))

================================================================================
maps
================================================================================

#{}

--------------------------------------------------------------------------------

(source
  (map))

================================================================================
records
================================================================================

#function{}
#Var{}
#function

--------------------------------------------------------------------------------

(source
  (record
    (atom))
  (record
    (variable))
  (record
    (atom)))
